import React from "react";
import "../styles/about.css";
import { VscGithubInverted } from "react-icons/vsc";
import gitBan from "../assets/gitgit.png";
import "../assets/fonts/Lalezar-Regular.ttf";

const About = () => {
  return (
    <div className="about">
      <main>
        <section>
          <h1>گیتهاب چیه و به چه دردی میخوره؟ معرفی گیتهاب برای تازه کارها</h1>
          <p className="subtext">ایجاد شده در تاریخ: 20 دی 1401</p>
          <img src={gitBan} alt="" className="blog-image" />
          <p className="content">
            در سطوح بالا، گیتهاب یک وبسایت و سرویس ابریه که به برنامه نویسا توی
            ذخیره کدها و مدیریت پروژه هاشون کمک میکنه مثل مدیریت و کنترل تغییرات
            ایجاد شده توی کدها. برای درک بهتر گیتهاب ، باید با دو اصل اساسی
            آَشنا شد:
          </p>
          <ul>
            <li>کنترل ورژن</li>
            <li>گیت</li>
          </ul>
          <p className="content">
            در این مقاله اول سعی میکنیم با این دو اصل آشنا بشیم و بعد با گیتهاب
            و داشبوردگیتهاب بیشتر آشنا میشیم تا اصطلاحات بکار برده شده توی
            وبسایتو بهتر درک کنیم. با ما در ادامه همراه باشید.
          </p>
        </section>
        <section>
          <h2>کنترل ورژن یعنی چی؟</h2>
          <p className="content">
            کنترل ورژ« کمک میکنه تا تغییرات ایجاد شده در کد منبع رو ثبت و مدیریت
            کنیم. به طور مثال فیسبوک رو در نظر بگیرید...
            <br />
            خب میدونیم که فیسبوک پروژه ی خیلی بزرگیه و تیم خیلی بزرگی روی اون
            کار میکنن و تقریبا شناسایی مدیریت اینکه چه کسی چه تغییری و در چه
            زمانی روی کد ایجاد کرده کار مشکل و حتی غیرممکنیه.
          </p>
          <p className="content">
            اگر توسعه دهنده ها قصد داشته باشن قسمتی از کد رو تغییر بدن، کار
            منطقی نیست که مستقیما رو منبع اصلی تغییرات رو ایجاد کنند چون اگه به
            هر دلیلی ویرایش با مشکل روبرو شد، کد منبع آسیب برگشت ناپذیری رو
            متحمل میشه. ولی کنترل ورژن کمک میکنه تا پروژه رو به بخش های مختلف
            تقسیم کنیم. در واقع کپی های رو از کد منبع ویرایش کنیم و اگه ویرایش
            به تایید نههایی رسید و تست هارو رد کرد، بتونیم در آخر اون رو به کد
            منبع اصلی اضافه کنیم.
            <br /> به کمک کنترل ورژن تمامی این تغییرات میتونن برگشت پذیر باشن در
            صورت نیاز، چون به طور دقیق و کامل همه تغییرات با جزِئیات ثبت شدن.
          </p>
        </section>
        <section>
          <h2>گیت چیه؟</h2>
          <p className="content">
            Git یک سیستم کنترل نسخه منبع باز خاصه که توسط لینوس توروالدز در سال
            2005 ایجاد شده. به طور خاص، Git یک سیستم کنترل نسخه توزیع شده ست، به
            این معنی که کل پایگاه کد و تاریخچه در رایانه هر توسعه دهنده در
            دسترسه، که امکان انشعاب و ادغام آسان رو فراهم می کنه.
            <br />
            طبق آخرین{" "}
            <a
              href="https://insights.stackoverflow.com/survey/2018/#work-version-control"
              target={"_blank"}
            >
              نظرسنجی استک اور فلو
            </a>
            ، حدود نود درصد برنامه نویسا از گیت استفاده میکنن .
          </p>
        </section>
        <section>
          <h2>گیتهاب چیه؟</h2>
          <p className="content">
            GitHub یک شرکت دولتی توی آمریکاست که که یک سرویس ابری برای هاستینگ
            ریپازیتوری های مبتنی به Git رو ارائه میده. <br />
            رابط کاربری گیتهاب در حد خیلی مقبولی کاربر پسنده بنابرین حتی
            کدنویسای مبتدی هم میتونند از مزایای گیتهاب بهره ببرند. بدون گیتهاب ،
            استفاده از گیت نیاز به دانش فنی و مهارت استفاده از خط فرمان داره.
            <br />
            با اینحال محیط کاربریه گیتهاب به قدری کاربر پسنده که حتی برخی از
            افراد برای مدیریت انوع دیگه پروژه ها مثل نوشتن کتاب از اون استفاده
            میکنن.
            <br />
            علاوه بر این گیتهاب هیچ محدودیتی در ثبتنام و استفاده رایگان نداره که
            همین باعث میشه خیلی بیشتر محبوب باشه.
          </p>
        </section>
        <section>
          <h2>داشبورد گیتهاب چیه و به چه دردی میخوره؟</h2>
          <p className="content">
            این وبسایت در واقع یه پروژه کوچیک و جمع و جوره که برای نشون دادن سطح
            مهارت خودم توی کار با فریموورک ری اکت، REST API ها و همچنین طراحی UI
            و کار با بعضی از کتابخونه های جاوااسکریپتی ساختمش.
            <br />
            داشبورد گیتهاب با جمع آوری یه سری داده از پایگاه داده های گیتهاب،
            اون هارو به صورت منظم و بصری در غالب چارت ها و نمودار ها درمیاره تا
            درک عمیق تری از فعالیت هامون توی گیتهاب داشته باشیم.
            <br />
            همه ی اطلاعات رد و بدل شده مستقیما بین کاربر و دیتابیس گیتهابه و
            اطلاعات شما هیچ جایی ذخیره نمیشه، و قسمت فرم و ثبتنام فقط به منظور
            شخصی سازی محیط کاربری طراحی شده. همچنین REST API گیتهاب محدودیت
            دریافت و ارسال داده داره و هر ساعت فقط میتونین تعداد مشخصی درخواست
            بدید.
          </p>
        </section>
      </main>
    </div>
  );
};

export default About;
